rnr-artillery-config.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 5
      arrivalRate: 5
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: "./rnr-artillery-functions.js"


scenarios:
  - flow:
      - get:
          url: /reviews/{{ productId }}/newest/5/1
          beforeRequest:
            - "generateRandomProduct"
      # - post:  # POST request to add review
      #     url: '/reviews'   # Assuming this is the correct endpoint to post a review
      #     json:
      #       product_id: "{{ productId }}"
      #       rating: "{{ rating }}"
      #       summary: "{{ summary }}"
      #       body: "{{ body }}"
      #       # Add other required fields here using the {{ }} syntax to use the values generated by the functions
      #     beforeRequest:
      #       - "generateReviewData"